yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostnrg388a.h
/*-------------------------------------------------------------------------
 *      STM8 definitions of SFR registers
 *
 *      Used with STM8 IAR C/C++ Compiler and Assembler.
 *
 *      Copyright 2017 IAR Systems AB.
 *
 *-----------------------------------------------------------------------*/

#ifndef __IOSTNRG388A_H__
#define __IOSTNRG388A_H__

#if (((__TID__ >> 8) & 0x7F) != 0x38)     /* 0x38 = 56 dec */
#error This file should only be compiled by STM8 IAR compiler and assembler
#endif

/*-------------------------------------------------------------------------
 *      I/O register macros
 *-----------------------------------------------------------------------*/

#include "io_macros.h"


#ifdef __IAR_SYSTEMS_ICC__
#pragma system_include
#pragma language=save
#pragma language=extended
#endif

/*-------------------------------------------------------------------------
 *      Option byte attribute define
 *-----------------------------------------------------------------------*/
 
#define OPTION_BYTE_ATTRIBUTES __root const volatile __ro_placement
 
/*-------------------------------------------------------------------------
 *      Option bytes register definitions
 *-----------------------------------------------------------------------*/

/*-------------------------------------------------------------------------
 *      Option bytes addresses
 *-----------------------------------------------------------------------*/
#define ROP_ADDR         0x4800
#define UCB_ADDR         0x4801
#define nUCB_ADDR        0x4802
#define GENCFG_ADDR      0x4803
#define nGENCFG_ADDR     0x4804
#define MISCUOPT_ADDR    0x4805
#define nMISCUOPT_ADDR   0x4806
#define CLKCTL_ADDR      0x4807
#define nCLKCTL_ADDR     0x4808
#define HSESTAB_ADDR     0x4809
#define nHSESTAB_ADDR    0x480a
#define ENHFEAT_ADDR     0x480b
#define nENHFEAT_ADDR    0x480c
#define WAITSTATE_ADDR   0x480d
#define nWAITSTATE_ADDR  0x480e
#define AFR_IOMXP0_ADDR  0x480f
#define nAFR_IOMXP0_ADDR 0x4810
#define AFR_IOMXP1_ADDR  0x4811
#define nAFR_IOMXP1_ADDR 0x4812
#define AFR_IOMXP2_ADDR  0x4813
#define nAFR_IOMXP2_ADDR 0x4814
#define MSC_OPT0_ADDR    0x4815
#define nMSC_OPT0_ADDR   0x4816
#define OPTBL_ADDR       0x487e
#define nOPTBL_ADDR      0x487f

#define ROP_DECL         OPTION_BYTE_ATTRIBUTES unsigned char ROP         @ ROP_ADDR
#define UCB_DECL         OPTION_BYTE_ATTRIBUTES unsigned char UCB         @ UCB_ADDR
#define nUCB_DECL        OPTION_BYTE_ATTRIBUTES unsigned char nUCB        @ nUCB_ADDR
#define GENCFG_DECL      OPTION_BYTE_ATTRIBUTES unsigned char GENCFG      @ GENCFG_ADDR
#define nGENCFG_DECL     OPTION_BYTE_ATTRIBUTES unsigned char nGENCFG     @ nGENCFG_ADDR
#define MISCUOPT_DECL    OPTION_BYTE_ATTRIBUTES unsigned char MISCUOPT    @ MISCUOPT_ADDR
#define nMISCUOPT_DECL   OPTION_BYTE_ATTRIBUTES unsigned char nMISCUOPT   @ nMISCUOPT_ADDR
#define CLKCTL_DECL      OPTION_BYTE_ATTRIBUTES unsigned char CLKCTL      @ CLKCTL_ADDR
#define nCLKCTL_DECL     OPTION_BYTE_ATTRIBUTES unsigned char nCLKCTL     @ nCLKCTL_ADDR
#define HSESTAB_DECL     OPTION_BYTE_ATTRIBUTES unsigned char HSESTAB     @ HSESTAB_ADDR
#define nHSESTAB_DECL    OPTION_BYTE_ATTRIBUTES unsigned char nHSESTAB    @ nHSESTAB_ADDR
#define ENHFEAT_DECL     OPTION_BYTE_ATTRIBUTES unsigned char ENHFEAT     @ ENHFEAT_ADDR
#define nENHFEAT_DECL    OPTION_BYTE_ATTRIBUTES unsigned char nENHFEAT    @ nENHFEAT_ADDR
#define WAITSTATE_DECL   OPTION_BYTE_ATTRIBUTES unsigned char WAITSTATE   @ WAITSTATE_ADDR
#define nWAITSTATE_DECL  OPTION_BYTE_ATTRIBUTES unsigned char nWAITSTATE  @ nWAITSTATE_ADDR
#define AFR_IOMXP0_DECL  OPTION_BYTE_ATTRIBUTES unsigned char AFR_IOMXP0  @ AFR_IOMXP0_ADDR
#define nAFR_IOMXP0_DECL OPTION_BYTE_ATTRIBUTES unsigned char nAFR_IOMXP0 @ nAFR_IOMXP0_ADDR
#define AFR_IOMXP1_DECL  OPTION_BYTE_ATTRIBUTES unsigned char AFR_IOMXP1  @ AFR_IOMXP1_ADDR
#define nAFR_IOMXP1_DECL OPTION_BYTE_ATTRIBUTES unsigned char nAFR_IOMXP1 @ nAFR_IOMXP1_ADDR
#define AFR_IOMXP2_DECL  OPTION_BYTE_ATTRIBUTES unsigned char AFR_IOMXP2  @ AFR_IOMXP2_ADDR
#define nAFR_IOMXP2_DECL OPTION_BYTE_ATTRIBUTES unsigned char nAFR_IOMXP2 @ nAFR_IOMXP2_ADDR
#define MSC_OPT0_DECL    OPTION_BYTE_ATTRIBUTES unsigned char MSC_OPT0    @ MSC_OPT0_ADDR
#define nMSC_OPT0_DECL   OPTION_BYTE_ATTRIBUTES unsigned char nMSC_OPT0   @ nMSC_OPT0_ADDR
#define OPTBL_DECL       OPTION_BYTE_ATTRIBUTES unsigned char OPTBL       @ OPTBL_ADDR
#define nOPTBL_DECL      OPTION_BYTE_ATTRIBUTES unsigned char nOPTBL      @ nOPTBL_ADDR


/*-------------------------------------------------------------------------
 *      Port 0 Registers register definitions
 *-----------------------------------------------------------------------*/
/* Port 0 output register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ODR0        : 1;
  unsigned char ODR1        : 1;
  unsigned char ODR2        : 1;
  unsigned char ODR3        : 1;
  unsigned char ODR4        : 1;
  unsigned char ODR5        : 1;
  unsigned char ODR6        : 1;
  unsigned char ODR7        : 1;
} __BITS_P0_ODR;
#endif
__IO_REG8_BIT(P0_ODR,      0x5000, __READ_WRITE, __BITS_P0_ODR);

/* Port 0 input register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IDR0        : 1;
  unsigned char IDR1        : 1;
  unsigned char IDR2        : 1;
  unsigned char IDR3        : 1;
  unsigned char IDR4        : 1;
  unsigned char IDR5        : 1;
  unsigned char IDR6        : 1;
  unsigned char IDR7        : 1;
} __BITS_P0_IDR;
#endif
__IO_REG8_BIT(P0_IDR,      0x5001, __READ, __BITS_P0_IDR);

/* Port 0 data direction register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DDR0        : 1;
  unsigned char DDR1        : 1;
  unsigned char DDR2        : 1;
  unsigned char DDR3        : 1;
  unsigned char DDR4        : 1;
  unsigned char DDR5        : 1;
  unsigned char DDR6        : 1;
  unsigned char DDR7        : 1;
} __BITS_P0_DDR;
#endif
__IO_REG8_BIT(P0_DDR,      0x5002, __READ_WRITE, __BITS_P0_DDR);

/* Port 0 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CR1_0       : 1;
  unsigned char CR1_1       : 1;
  unsigned char CR1_2       : 1;
  unsigned char CR1_3       : 1;
  unsigned char CR1_4       : 1;
  unsigned char CR1_5       : 1;
  unsigned char CR1_6       : 1;
  unsigned char CR1_7       : 1;
} __BITS_P0_CR1;
#endif
__IO_REG8_BIT(P0_CR1,      0x5003, __READ_WRITE, __BITS_P0_CR1);

