yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostnrg388a.h
/* Start Of Conversion */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SOC         : 1;
} __BITS_ADC_SOC;
#endif
__IO_REG8_BIT(ADC_SOC,     0x5401, __WRITE, __BITS_ADC_SOC);

/* Interrupt Enable Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EOC_EN      : 1;
  unsigned char EOS_EN      : 1;
  unsigned char SEQ_FULL_EN : 1;
} __BITS_ADC_IER;
#endif
__IO_REG8_BIT(ADC_IER,     0x5402, __READ_WRITE, __BITS_ADC_IER);

/* Sequencer Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH          : 3;
  unsigned char GAIN        : 1;
} __BITS_ADC_SEQ;
#endif
__IO_REG8_BIT(ADC_SEQ,     0x5403, __WRITE, __BITS_ADC_SEQ);

/* Data Low Register */
__IO_REG8    (ADC_DATL_0,  0x5404, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_0;
#endif
__IO_REG8_BIT(ADC_DATH_0,  0x5405, __READ, __BITS_ADC_DATH_0);

/* Data Low Register */
__IO_REG8    (ADC_DATL_1,  0x5406, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_1;
#endif
__IO_REG8_BIT(ADC_DATH_1,  0x5407, __READ, __BITS_ADC_DATH_1);

/* Data Low Register */
__IO_REG8    (ADC_DATL_2,  0x5408, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_2;
#endif
__IO_REG8_BIT(ADC_DATH_2,  0x5409, __READ, __BITS_ADC_DATH_2);

/* Data Low Register */
__IO_REG8    (ADC_DATL_3,  0x540A, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_3;
#endif
__IO_REG8_BIT(ADC_DATH_3,  0x540B, __READ, __BITS_ADC_DATH_3);

/* Data Low Register */
__IO_REG8    (ADC_DATL_4,  0x540C, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_4;
#endif
__IO_REG8_BIT(ADC_DATH_4,  0x540D, __READ, __BITS_ADC_DATH_4);

/* Data Low Register */
__IO_REG8    (ADC_DATL_5,  0x540E, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_5;
#endif
__IO_REG8_BIT(ADC_DATH_5,  0x540F, __READ, __BITS_ADC_DATH_5);

/* Data Low Register */
__IO_REG8    (ADC_DATL_6,  0x5410, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_6;
#endif
__IO_REG8_BIT(ADC_DATH_6,  0x5411, __READ, __BITS_ADC_DATH_6);

/* Data Low Register */
__IO_REG8    (ADC_DATL_7,  0x5412, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_7;
#endif
__IO_REG8_BIT(ADC_DATH_7,  0x5413, __READ, __BITS_ADC_DATH_7);

/* Status Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EOC         : 1;
  unsigned char EOS         : 1;
  unsigned char SEQ_FULL    : 1;
} __BITS_ADC_SR;
#endif
__IO_REG8_BIT(ADC_SR,      0x5414, __READ_WRITE, __BITS_ADC_SR);

/* SOC Delay Counter Register */
__IO_REG8    (ADC_DLYCNT,  0x5415, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      ADC Registers bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define ADC_CFG_PD               ADC_CFG_bit.PD
#define ADC_CFG_STOP             ADC_CFG_bit.STOP
#define ADC_CFG_FIFO_FLUSH       ADC_CFG_bit.FIFO_FLUSH
#define ADC_CFG_CIRCULAR         ADC_CFG_bit.CIRCULAR
#define ADC_CFG_FORMAT           ADC_CFG_bit.FORMAT

#define ADC_SOC_SOC              ADC_SOC_bit.SOC

#define ADC_IER_EOC_EN           ADC_IER_bit.EOC_EN
#define ADC_IER_EOS_EN           ADC_IER_bit.EOS_EN
#define ADC_IER_SEQ_FULL_EN      ADC_IER_bit.SEQ_FULL_EN

#define ADC_SEQ_CH               ADC_SEQ_bit.CH
#define ADC_SEQ_GAIN             ADC_SEQ_bit.GAIN

#define ADC_DATH_0_DATA_HIGH     ADC_DATH_0_bit.DATA_HIGH

#define ADC_DATH_1_DATA_HIGH     ADC_DATH_1_bit.DATA_HIGH

#define ADC_DATH_2_DATA_HIGH     ADC_DATH_2_bit.DATA_HIGH

#define ADC_DATH_3_DATA_HIGH     ADC_DATH_3_bit.DATA_HIGH

#define ADC_DATH_4_DATA_HIGH     ADC_DATH_4_bit.DATA_HIGH

#define ADC_DATH_5_DATA_HIGH     ADC_DATH_5_bit.DATA_HIGH

#define ADC_DATH_6_DATA_HIGH     ADC_DATH_6_bit.DATA_HIGH

#define ADC_DATH_7_DATA_HIGH     ADC_DATH_7_bit.DATA_HIGH

#define ADC_SR_EOC               ADC_SR_bit.EOC
#define ADC_SR_EOS               ADC_SR_bit.EOS
#define ADC_SR_SEQ_FULL          ADC_SR_bit.SEQ_FULL

#endif

/*-------------------------------------------------------------------------
 *      ADC Registers bit masks
 *-----------------------------------------------------------------------*/
#define MASK_ADC_CFG_PD          0x01
#define MASK_ADC_CFG_STOP        0x02
#define MASK_ADC_CFG_FIFO_FLUSH  0x04
#define MASK_ADC_CFG_CIRCULAR    0x08
#define MASK_ADC_CFG_FORMAT      0x10

#define MASK_ADC_SOC_SOC         0x01

#define MASK_ADC_IER_EOC_EN      0x01
#define MASK_ADC_IER_EOS_EN      0x02
#define MASK_ADC_IER_SEQ_FULL_EN 0x04

#define MASK_ADC_SEQ_CH          0x07
#define MASK_ADC_SEQ_GAIN        0x08

#define MASK_ADC_DATH_0_DATA_HIGH 0x03

#define MASK_ADC_DATH_1_DATA_HIGH 0x03

#define MASK_ADC_DATH_2_DATA_HIGH 0x03

#define MASK_ADC_DATH_3_DATA_HIGH 0x03

#define MASK_ADC_DATH_4_DATA_HIGH 0x03

#define MASK_ADC_DATH_5_DATA_HIGH 0x03

#define MASK_ADC_DATH_6_DATA_HIGH 0x03

#define MASK_ADC_DATH_7_DATA_HIGH 0x03

#define MASK_ADC_SR_EOC          0x01
#define MASK_ADC_SR_EOS          0x02
#define MASK_ADC_SR_SEQ_FULL     0x04


/*-------------------------------------------------------------------------
 *      SMED 0 Registers register definitions
 *-----------------------------------------------------------------------*/
/* Control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char START_CNT   : 1;
  unsigned char FSM_ENA     : 1;
} __BITS_SMD0_CTR;
#endif
__IO_REG8_BIT(SMD0_CTR,    0x5500, __READ_WRITE, __BITS_SMD0_CTR);

/* Control timer register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIME_T0_VAL : 1;
  unsigned char TIME_T1_VAL : 1;
  unsigned char TIME_T2_VAL : 1;
  unsigned char TIME_T3_VAL : 1;
  unsigned char DITHER_VAL  : 1;
} __BITS_SMD0_CTR_TMR;
#endif
__IO_REG8_BIT(SMD0_CTR_TMR, 0x5501, __READ_WRITE, __BITS_SMD0_CTR_TMR);

/* Control input register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RS_INSIG0   : 1;
  unsigned char RS_INSIG1   : 1;
  unsigned char RS_INSIG2   : 1;
  unsigned char RAIS_EN     : 1;
  unsigned char EL_INSIG0   : 1;
  unsigned char EL_INSIG1   : 1;
  unsigned char EL_INSIG2   : 1;
  unsigned char EL_EN       : 1;
} __BITS_SMD0_CTR_INP;
#endif
__IO_REG8_BIT(SMD0_CTR_INP, 0x5502, __READ_WRITE, __BITS_SMD0_CTR_INP);

/* Dithering register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DITH0       : 1;
  unsigned char DITH1       : 1;
  unsigned char DITH2       : 1;
  unsigned char DITH3       : 1;
  unsigned char DITH4       : 1;
  unsigned char DITH5       : 1;
  unsigned char DITH6       : 1;
  unsigned char DITH7       : 1;
} __BITS_SMD0_CTR_DTHR;
#endif
__IO_REG8_BIT(SMD0_CTR_DTHR, 0x5503, __READ_WRITE, __BITS_SMD0_CTR_DTHR);

/* Time T0 lsb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T0L0    : 1;
  unsigned char TIM_T0L1    : 1;
  unsigned char TIM_T0L2    : 1;
  unsigned char TIM_T0L3    : 1;
  unsigned char TIM_T0L4    : 1;
  unsigned char TIM_T0L5    : 1;
  unsigned char TIM_T0L6    : 1;
  unsigned char TIM_T0L7    : 1;
} __BITS_SMD0_TMR_T0L;
#endif
__IO_REG8_BIT(SMD0_TMR_T0L, 0x5504, __READ_WRITE, __BITS_SMD0_TMR_T0L);

/* Time T0 msb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T0H0    : 1;
  unsigned char TIM_T0H1    : 1;
  unsigned char TIM_T0H2    : 1;
  unsigned char TIM_T0H3    : 1;
  unsigned char TIM_T0H4    : 1;
  unsigned char TIM_T0H5    : 1;
  unsigned char TIM_T0H6    : 1;
  unsigned char TIM_T0H7    : 1;
} __BITS_SMD0_TMR_T0H;
#endif
__IO_REG8_BIT(SMD0_TMR_T0H, 0x5505, __READ_WRITE, __BITS_SMD0_TMR_T0H);

