yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostnrg388a.h
/* Time T1 lsb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T1L0    : 1;
  unsigned char TIM_T1L1    : 1;
  unsigned char TIM_T1L2    : 1;
  unsigned char TIM_T1L3    : 1;
  unsigned char TIM_T1L4    : 1;
  unsigned char TIM_T1L5    : 1;
  unsigned char TIM_T1L6    : 1;
  unsigned char TIM_T1L7    : 1;
} __BITS_SMD4_TMR_T1L;
#endif
__IO_REG8_BIT(SMD4_TMR_T1L, 0x5606, __READ_WRITE, __BITS_SMD4_TMR_T1L);

/* Time T1 msb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T1H0    : 1;
  unsigned char TIM_T1H1    : 1;
  unsigned char TIM_T1H2    : 1;
  unsigned char TIM_T1H3    : 1;
  unsigned char TIM_T1H4    : 1;
  unsigned char TIM_T1H5    : 1;
  unsigned char TIM_T1H6    : 1;
  unsigned char TIM_T1H7    : 1;
} __BITS_SMD4_TMR_T1H;
#endif
__IO_REG8_BIT(SMD4_TMR_T1H, 0x5607, __READ_WRITE, __BITS_SMD4_TMR_T1H);

/* Time T2 lsb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T2L0    : 1;
  unsigned char TIM_T2L1    : 1;
  unsigned char TIM_T2L2    : 1;
  unsigned char TIM_T2L3    : 1;
  unsigned char TIM_T2L4    : 1;
  unsigned char TIM_T2L5    : 1;
  unsigned char TIM_T2L6    : 1;
  unsigned char TIM_T2L7    : 1;
} __BITS_SMD4_TMR_T2L;
#endif
__IO_REG8_BIT(SMD4_TMR_T2L, 0x5608, __READ_WRITE, __BITS_SMD4_TMR_T2L);

/* Time T2 msb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T2H0    : 1;
  unsigned char TIM_T2H1    : 1;
  unsigned char TIM_T2H2    : 1;
  unsigned char TIM_T2H3    : 1;
  unsigned char TIM_T2H4    : 1;
  unsigned char TIM_T2H5    : 1;
  unsigned char TIM_T2H6    : 1;
  unsigned char TIM_T2H7    : 1;
} __BITS_SMD4_TMR_T2H;
#endif
__IO_REG8_BIT(SMD4_TMR_T2H, 0x5609, __READ_WRITE, __BITS_SMD4_TMR_T2H);

/* Time T3 lsb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T3L0    : 1;
  unsigned char TIM_T3L1    : 1;
  unsigned char TIM_T3L2    : 1;
  unsigned char TIM_T3L3    : 1;
  unsigned char TIM_T3L4    : 1;
  unsigned char TIM_T3L5    : 1;
  unsigned char TIM_T3L6    : 1;
  unsigned char TIM_T3L7    : 1;
} __BITS_SMD4_TMR_T3L;
#endif
__IO_REG8_BIT(SMD4_TMR_T3L, 0x560A, __READ_WRITE, __BITS_SMD4_TMR_T3L);

/* Time T3 msb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T3H0    : 1;
  unsigned char TIM_T3H1    : 1;
  unsigned char TIM_T3H2    : 1;
  unsigned char TIM_T3H3    : 1;
  unsigned char TIM_T3H4    : 1;
  unsigned char TIM_T3H5    : 1;
  unsigned char TIM_T3H6    : 1;
  unsigned char TIM_T3H7    : 1;
} __BITS_SMD4_TMR_T3H;
#endif
__IO_REG8_BIT(SMD4_TMR_T3H, 0x560B, __READ_WRITE, __BITS_SMD4_TMR_T3H);

/* Parameter 0 IDLE register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NX_STAT0    : 1;
  unsigned char NX_STAT1    : 1;
  unsigned char EDGE0       : 1;
  unsigned char EDGE1       : 1;
  unsigned char CNT_RSTE    : 1;
  unsigned char PULS_EDG    : 1;
  unsigned char HOLD_JMP    : 1;
  unsigned char AND_OR      : 1;
} __BITS_SMD4_PRM_ID0;
#endif
__IO_REG8_BIT(SMD4_PRM_ID0, 0x560C, __READ_WRITE, __BITS_SMD4_PRM_ID0);

/* Parameter 1 IDLE register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 2;
  unsigned char CEDGE0      : 1;
  unsigned char CEDGE1      : 1;
  unsigned char CNT_RSTC    : 1;
  unsigned char PULS_CMP    : 1;
  unsigned char HOLD_EXIT   : 1;
} __BITS_SMD4_PRM_ID1;
#endif
__IO_REG8_BIT(SMD4_PRM_ID1, 0x560D, __READ_WRITE, __BITS_SMD4_PRM_ID1);

/* Parameter 2 IDLE register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LATCH_RS    : 1;
} __BITS_SMD4_PRM_ID2;
#endif
__IO_REG8_BIT(SMD4_PRM_ID2, 0x560E, __READ_WRITE, __BITS_SMD4_PRM_ID2);

/* Parameter 0 S0 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NX_STAT0    : 1;
  unsigned char NX_STAT1    : 1;
  unsigned char EDGE0       : 1;
  unsigned char EDGE1       : 1;
  unsigned char CNT_RSTE    : 1;
  unsigned char PULS_EDG    : 1;
  unsigned char HOLD_JMP    : 1;
  unsigned char AND_OR      : 1;
} __BITS_SMD4_PRM_S00;
#endif
__IO_REG8_BIT(SMD4_PRM_S00, 0x560F, __READ_WRITE, __BITS_SMD4_PRM_S00);

/* Parameter 1 S0 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 2;
  unsigned char CEDGE0      : 1;
  unsigned char CEDGE1      : 1;
  unsigned char CNT_RSTC    : 1;
  unsigned char PULS_CMP    : 1;
  unsigned char HOLD_EXIT   : 1;
} __BITS_SMD4_PRM_S01;
#endif
__IO_REG8_BIT(SMD4_PRM_S01, 0x5610, __READ_WRITE, __BITS_SMD4_PRM_S01);

/* Parameter 2 S0 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LATCH_RS    : 1;
} __BITS_SMD4_PRM_S02;
#endif
__IO_REG8_BIT(SMD4_PRM_S02, 0x5611, __READ_WRITE, __BITS_SMD4_PRM_S02);

/* Parameter 0 S1 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NX_STAT0    : 1;
  unsigned char NX_STAT1    : 1;
  unsigned char EDGE0       : 1;
  unsigned char EDGE1       : 1;
  unsigned char CNT_RSTE    : 1;
  unsigned char PULS_EDG    : 1;
  unsigned char HOLD_JMP    : 1;
  unsigned char AND_OR      : 1;
} __BITS_SMD4_PRM_S10;
#endif
__IO_REG8_BIT(SMD4_PRM_S10, 0x5612, __READ_WRITE, __BITS_SMD4_PRM_S10);

/* Parameter 1 S1 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 2;
  unsigned char CEDGE0      : 1;
  unsigned char CEDGE1      : 1;
  unsigned char CNT_RSTC    : 1;
  unsigned char PULS_CMP    : 1;
  unsigned char HOLD_EXIT   : 1;
} __BITS_SMD4_PRM_S11;
#endif
__IO_REG8_BIT(SMD4_PRM_S11, 0x5613, __READ_WRITE, __BITS_SMD4_PRM_S11);

/* Parameter 2 S1 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LATCH_RS    : 1;
} __BITS_SMD4_PRM_S12;
#endif
__IO_REG8_BIT(SMD4_PRM_S12, 0x5614, __READ_WRITE, __BITS_SMD4_PRM_S12);

/* Parameter 0 S2 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NX_STAT0    : 1;
  unsigned char NX_STAT1    : 1;
  unsigned char EDGE0       : 1;
  unsigned char EDGE1       : 1;
  unsigned char CNT_RSTE    : 1;
  unsigned char PULS_EDG    : 1;
  unsigned char HOLD_JMP    : 1;
  unsigned char AND_OR      : 1;
} __BITS_SMD4_PRM_S20;
#endif
__IO_REG8_BIT(SMD4_PRM_S20, 0x5615, __READ_WRITE, __BITS_SMD4_PRM_S20);

/* Parameter 1 S2 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 2;
  unsigned char CEDGE0      : 1;
  unsigned char CEDGE1      : 1;
  unsigned char CNT_RSTC    : 1;
  unsigned char PULS_CMP    : 1;
  unsigned char HOLD_EXIT   : 1;
} __BITS_SMD4_PRM_S21;
#endif
__IO_REG8_BIT(SMD4_PRM_S21, 0x5616, __READ_WRITE, __BITS_SMD4_PRM_S21);

