yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostnrg388a.h
/* Interrupt software priority register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VECT4SPR    : 2;
  unsigned char VECT5SPR    : 2;
  unsigned char VECT6SPR    : 2;
  unsigned char VECT7SPR    : 2;
} __BITS_ITC_SPR1;
#endif
__IO_REG8_BIT(ITC_SPR1,    0x7F71, __READ_WRITE, __BITS_ITC_SPR1);

/* Interrupt software priority register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VECT8SPR    : 2;
  unsigned char VECT9SPR    : 2;
  unsigned char VECT10SPR   : 2;
  unsigned char VECT11SPR   : 2;
} __BITS_ITC_SPR2;
#endif
__IO_REG8_BIT(ITC_SPR2,    0x7F72, __READ_WRITE, __BITS_ITC_SPR2);

/* Interrupt software priority register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VECT12SPR   : 2;
  unsigned char VECT13SPR   : 2;
  unsigned char VECT14SPR   : 2;
  unsigned char VECT15SPR   : 2;
} __BITS_ITC_SPR3;
#endif
__IO_REG8_BIT(ITC_SPR3,    0x7F73, __READ_WRITE, __BITS_ITC_SPR3);

/* Interrupt software priority register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VECT16SPR   : 2;
  unsigned char VECT17SPR   : 2;
  unsigned char VECT18SPR   : 2;
  unsigned char VECT19SPR   : 2;
} __BITS_ITC_SPR4;
#endif
__IO_REG8_BIT(ITC_SPR4,    0x7F74, __READ_WRITE, __BITS_ITC_SPR4);

/* Interrupt software priority register 5 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VECT20SPR   : 2;
  unsigned char VECT21SPR   : 2;
  unsigned char VECT22SPR   : 2;
  unsigned char VECT23SPR   : 2;
} __BITS_ITC_SPR5;
#endif
__IO_REG8_BIT(ITC_SPR5,    0x7F75, __READ_WRITE, __BITS_ITC_SPR5);

/* Interrupt software priority register 6 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VECT24SPR   : 2;
  unsigned char VECT25SPR   : 2;
  unsigned char VECT26SPR   : 2;
  unsigned char VECT27SPR   : 2;
} __BITS_ITC_SPR6;
#endif
__IO_REG8_BIT(ITC_SPR6,    0x7F76, __READ_WRITE, __BITS_ITC_SPR6);

/* Interrupt software priority register 7 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VECT28SPR   : 2;
  unsigned char VECT29SPR   : 2;
} __BITS_ITC_SPR7;
#endif
__IO_REG8_BIT(ITC_SPR7,    0x7F77, __READ_WRITE, __BITS_ITC_SPR7);


/*-------------------------------------------------------------------------
 *      ITC bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define ITC_SPR0_VECT1SPR        ITC_SPR0_bit.VECT1SPR
#define ITC_SPR0_VECT2SPR        ITC_SPR0_bit.VECT2SPR
#define ITC_SPR0_VECT3SPR        ITC_SPR0_bit.VECT3SPR

#define ITC_SPR1_VECT4SPR        ITC_SPR1_bit.VECT4SPR
#define ITC_SPR1_VECT5SPR        ITC_SPR1_bit.VECT5SPR
#define ITC_SPR1_VECT6SPR        ITC_SPR1_bit.VECT6SPR
#define ITC_SPR1_VECT7SPR        ITC_SPR1_bit.VECT7SPR

#define ITC_SPR2_VECT8SPR        ITC_SPR2_bit.VECT8SPR
#define ITC_SPR2_VECT9SPR        ITC_SPR2_bit.VECT9SPR
#define ITC_SPR2_VECT10SPR       ITC_SPR2_bit.VECT10SPR
#define ITC_SPR2_VECT11SPR       ITC_SPR2_bit.VECT11SPR

#define ITC_SPR3_VECT12SPR       ITC_SPR3_bit.VECT12SPR
#define ITC_SPR3_VECT13SPR       ITC_SPR3_bit.VECT13SPR
#define ITC_SPR3_VECT14SPR       ITC_SPR3_bit.VECT14SPR
#define ITC_SPR3_VECT15SPR       ITC_SPR3_bit.VECT15SPR

#define ITC_SPR4_VECT16SPR       ITC_SPR4_bit.VECT16SPR
#define ITC_SPR4_VECT17SPR       ITC_SPR4_bit.VECT17SPR
#define ITC_SPR4_VECT18SPR       ITC_SPR4_bit.VECT18SPR
#define ITC_SPR4_VECT19SPR       ITC_SPR4_bit.VECT19SPR

#define ITC_SPR5_VECT20SPR       ITC_SPR5_bit.VECT20SPR
#define ITC_SPR5_VECT21SPR       ITC_SPR5_bit.VECT21SPR
#define ITC_SPR5_VECT22SPR       ITC_SPR5_bit.VECT22SPR
#define ITC_SPR5_VECT23SPR       ITC_SPR5_bit.VECT23SPR

#define ITC_SPR6_VECT24SPR       ITC_SPR6_bit.VECT24SPR
#define ITC_SPR6_VECT25SPR       ITC_SPR6_bit.VECT25SPR
#define ITC_SPR6_VECT26SPR       ITC_SPR6_bit.VECT26SPR
#define ITC_SPR6_VECT27SPR       ITC_SPR6_bit.VECT27SPR

#define ITC_SPR7_VECT28SPR       ITC_SPR7_bit.VECT28SPR
#define ITC_SPR7_VECT29SPR       ITC_SPR7_bit.VECT29SPR

#endif

/*-------------------------------------------------------------------------
 *      ITC bit masks
 *-----------------------------------------------------------------------*/
#define MASK_ITC_SPR0_VECT1SPR   0x0C
#define MASK_ITC_SPR0_VECT2SPR   0x30
#define MASK_ITC_SPR0_VECT3SPR   0xC0

#define MASK_ITC_SPR1_VECT4SPR   0x03
#define MASK_ITC_SPR1_VECT5SPR   0x0C
#define MASK_ITC_SPR1_VECT6SPR   0x30
#define MASK_ITC_SPR1_VECT7SPR   0xC0

#define MASK_ITC_SPR2_VECT8SPR   0x03
#define MASK_ITC_SPR2_VECT9SPR   0x0C
#define MASK_ITC_SPR2_VECT10SPR  0x30
#define MASK_ITC_SPR2_VECT11SPR  0xC0

#define MASK_ITC_SPR3_VECT12SPR  0x03
#define MASK_ITC_SPR3_VECT13SPR  0x0C
#define MASK_ITC_SPR3_VECT14SPR  0x30
#define MASK_ITC_SPR3_VECT15SPR  0xC0

#define MASK_ITC_SPR4_VECT16SPR  0x03
#define MASK_ITC_SPR4_VECT17SPR  0x0C
#define MASK_ITC_SPR4_VECT18SPR  0x30
#define MASK_ITC_SPR4_VECT19SPR  0xC0

#define MASK_ITC_SPR5_VECT20SPR  0x03
#define MASK_ITC_SPR5_VECT21SPR  0x0C
#define MASK_ITC_SPR5_VECT22SPR  0x30
#define MASK_ITC_SPR5_VECT23SPR  0xC0

#define MASK_ITC_SPR6_VECT24SPR  0x03
#define MASK_ITC_SPR6_VECT25SPR  0x0C
#define MASK_ITC_SPR6_VECT26SPR  0x30
#define MASK_ITC_SPR6_VECT27SPR  0xC0

#define MASK_ITC_SPR7_VECT28SPR  0x03
#define MASK_ITC_SPR7_VECT29SPR  0x0C


/*-------------------------------------------------------------------------
 *      Interrupt vector numbers
 *
 *  Note: The vector numbers listed in ST's manuals for STM8 are offset
 *        by 2 compared to the vector numbers used by EWSTM8.
 *-----------------------------------------------------------------------*/
#define AWU_vector                            3 /* IRQ No. in STM8 manual:  1 */
#define CLK_CSS_vector                        4 /* IRQ No. in STM8 manual:  2 */
#define CLK_SWITCH_vector                     4 /* IRQ No. in STM8 manual:  2 */
#define GPIO0_INT_vector                      5 /* IRQ No. in STM8 manual:  3 */
#define GPIO1_INT_vector                      5 /* IRQ No. in STM8 manual:  3 */
#define GPIO2_INT_vector                      5 /* IRQ No. in STM8 manual:  3 */
#define GPIO3_INT_vector                      5 /* IRQ No. in STM8 manual:  3 */
#define GPIO4_INT_vector                      5 /* IRQ No. in STM8 manual:  3 */
#define GPIO5_INT_vector                      5 /* IRQ No. in STM8 manual:  3 */
#define DIGIN0_INT_vector                     7 /* IRQ No. in STM8 manual:  5 */
#define DIGIN1_INT_vector                     7 /* IRQ No. in STM8 manual:  5 */
#define DIGIN2_INT_vector                     7 /* IRQ No. in STM8 manual:  5 */
#define DIGIN3_INT_vector                     7 /* IRQ No. in STM8 manual:  5 */
#define DIGIN4_INT_vector                     7 /* IRQ No. in STM8 manual:  5 */
#define DIGIN5_INT_vector                     7 /* IRQ No. in STM8 manual:  5 */
#define SMED0_OVF_vector                      8 /* IRQ No. in STM8 manual:  6 */
#define SMED0_STATE0_vector                   8 /* IRQ No. in STM8 manual:  6 */
#define SMED0_STATE1_vector                   8 /* IRQ No. in STM8 manual:  6 */
#define SMED0_STATE2_vector                   8 /* IRQ No. in STM8 manual:  6 */
#define SMED0_STATE3_vector                   8 /* IRQ No. in STM8 manual:  6 */
#define SMEDO_INSIG0_vector                   8 /* IRQ No. in STM8 manual:  6 */
#define SMEDO_INSIG1_vector                   8 /* IRQ No. in STM8 manual:  6 */
#define SMEDO_INSIG2_vector                   8 /* IRQ No. in STM8 manual:  6 */
#define SMED1_INSIG0_vector                   9 /* IRQ No. in STM8 manual:  7 */
#define SMED1_INSIG1_vector                   9 /* IRQ No. in STM8 manual:  7 */
#define SMED1_INSIG2_vector                   9 /* IRQ No. in STM8 manual:  7 */
#define SMED1_OVF_vector                      9 /* IRQ No. in STM8 manual:  7 */
#define SMED1_STATE0_vector                   9 /* IRQ No. in STM8 manual:  7 */
#define SMED1_STATE1_vector                   9 /* IRQ No. in STM8 manual:  7 */
#define SMED1_STATE2_vector                   9 /* IRQ No. in STM8 manual:  7 */
#define SMED1_STATE3_vector                   9 /* IRQ No. in STM8 manual:  7 */
#define SMED2_INSIG0_vector                  17 /* IRQ No. in STM8 manual: 15 */
#define SMED2_INSIG1_vector                  17 /* IRQ No. in STM8 manual: 15 */
#define SMED2_INSIG2_vector                  17 /* IRQ No. in STM8 manual: 15 */
#define SMED2_OVF_vector                     17 /* IRQ No. in STM8 manual: 15 */
#define SMED2_STATE0_vector                  17 /* IRQ No. in STM8 manual: 15 */
#define SMED2_STATE1_vector                  17 /* IRQ No. in STM8 manual: 15 */
#define SMED2_STATE2_vector                  17 /* IRQ No. in STM8 manual: 15 */
#define SMED2_STATE3_vector                  17 /* IRQ No. in STM8 manual: 15 */
#define SMED3_INSIG0_vector                  18 /* IRQ No. in STM8 manual: 16 */
#define SMED3_INSIG1_vector                  18 /* IRQ No. in STM8 manual: 16 */
#define SMED3_INSIG2_vector                  18 /* IRQ No. in STM8 manual: 16 */
#define SMED3_OVF_vector                     18 /* IRQ No. in STM8 manual: 16 */
#define SMED3_STATE0_vector                  18 /* IRQ No. in STM8 manual: 16 */
#define SMED3_STATE1_vector                  18 /* IRQ No. in STM8 manual: 16 */
#define SMED3_STATE2_vector                  18 /* IRQ No. in STM8 manual: 16 */
#define SMED3_STATE3_vector                  18 /* IRQ No. in STM8 manual: 16 */
#define UART_T_TC_vector                     19 /* IRQ No. in STM8 manual: 17 */
#define UART_T_TXE_vector                    19 /* IRQ No. in STM8 manual: 17 */
#define UART_R_IDLE_vector                   20 /* IRQ No. in STM8 manual: 18 */
#define UART_R_OR_vector                     20 /* IRQ No. in STM8 manual: 18 */
#define UART_R_PE_vector                     20 /* IRQ No. in STM8 manual: 18 */
#define UART_R_RXNE_vector                   20 /* IRQ No. in STM8 manual: 18 */
#define I2C_ADD10_vector                     21 /* IRQ No. in STM8 manual: 19 */
#define I2C_ADDR_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define I2C_AF_vector                        21 /* IRQ No. in STM8 manual: 19 */
#define I2C_ARLO_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define I2C_BERR_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define I2C_BTF_vector                       21 /* IRQ No. in STM8 manual: 19 */
#define I2C_OVR_vector                       21 /* IRQ No. in STM8 manual: 19 */
#define I2C_RXNE_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define I2C_SB_vector                        21 /* IRQ No. in STM8 manual: 19 */
#define I2C_STOPF_vector                     21 /* IRQ No. in STM8 manual: 19 */
#define I2C_TXE_vector                       21 /* IRQ No. in STM8 manual: 19 */
#define ADC_EOC_vector                       24 /* IRQ No. in STM8 manual: 22 */
#define ADC_EOS_vector                       24 /* IRQ No. in STM8 manual: 22 */
#define ADC_SEQ_vector                       24 /* IRQ No. in STM8 manual: 22 */
#define STMR_OVF_vector                      25 /* IRQ No. in STM8 manual: 23 */
#define FLASH_EOP_vector                     26 /* IRQ No. in STM8 manual: 24 */
#define FLASH_WR_PG_DIS_vector               26 /* IRQ No. in STM8 manual: 24 */
#define DALI_ITF_vector                      27 /* IRQ No. in STM8 manual: 25 */
#define DALI_WDGF_vector                     27 /* IRQ No. in STM8 manual: 25 */
#define SMED4_INSIG0_vector                  28 /* IRQ No. in STM8 manual: 26 */
#define SMED4_INSIG1_vector                  28 /* IRQ No. in STM8 manual: 26 */
#define SMED4_INSIG2_vector                  28 /* IRQ No. in STM8 manual: 26 */
#define SMED4_OVF_vector                     28 /* IRQ No. in STM8 manual: 26 */
#define SMED4_STATE0_vector                  28 /* IRQ No. in STM8 manual: 26 */
#define SMED4_STATE1_vector                  28 /* IRQ No. in STM8 manual: 26 */
#define SMED4_STATE2_vector                  28 /* IRQ No. in STM8 manual: 26 */
#define SMED4_STATE3_vector                  28 /* IRQ No. in STM8 manual: 26 */
#define SMED5_INSIG0_vector                  29 /* IRQ No. in STM8 manual: 27 */
#define SMED5_INSIG1_vector                  29 /* IRQ No. in STM8 manual: 27 */
#define SMED5_INSIG2_vector                  29 /* IRQ No. in STM8 manual: 27 */
#define SMED5_OVF_vector                     29 /* IRQ No. in STM8 manual: 27 */
#define SMED5_STATE0_vector                  29 /* IRQ No. in STM8 manual: 27 */
#define SMED5_STATE1_vector                  29 /* IRQ No. in STM8 manual: 27 */
#define SMED5_STATE2_vector                  29 /* IRQ No. in STM8 manual: 27 */
#define SMED5_STATE3_vector                  29 /* IRQ No. in STM8 manual: 27 */

#ifdef __IAR_SYSTEMS_ICC__
#pragma language=restore
#endif

#endif    /* __IOSTNRG388A_H__ */

/*----------------------------------------------
 *      End of file
 *--------------------------------------------*/
